app/controllers/performances_controller.rb

SELECT "performances".* FROM "performances"
---
  def index
    @performances = Performance.all