app/controllers/performers_controller.rb

SELECT "performers".* FROM "performers" ORDER BY "performers"."id" DESC LIMIT 1
---
  def index
    @performers = Performer.all

SELECT performers.*, (69.09332411348201 * ABS(performers.latitude - 39.9522) * 0.7071067811865475) + (59.836573914187355 * ABS(performers.longitude - -75.1642) * 0.7071067811865475) AS distance, CASE WHEN (performers.latitude >= 39.9522 AND performers.longitude >= -75.1642) THEN 45.0 WHEN (performers.latitude < 39.9522 AND performers.longitude >= -75.1642) THEN 135.0 WHEN (performers.latitude < 39.9522 AND performers.longitude < -75.1642) THEN 225.0 WHEN (performers.latitude >= 39.9522 AND performers.longitude < -75.1642) THEN 315.0 END AS bearing FROM "performers" WHERE (performers.latitude BETWEEN 39.80746821688915 AND 40.09693178311085 AND performers.longitude BETWEEN -75.35300182279758 AND -74.97539817720241 AND performers.id != 2) ORDER BY distance ASC
---
  def show
    @performer = Performer.find(params[:id])